---
kind: other
id: Methods.T:Autodesk.Revit.DB.ReferencePlane
source: html/ac600729-3355-2dcf-3663-79b569e51cfb.htm
---
# ReferencePlane Methods

Adds a default Leader for the indicated end of the datum plane. This method does not apply to Reference planes (which do not support leaders).